# RbsAreaBasedLoadType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsAreaBasedLoadType Property
ParameterTypeId Class See Also
---
"Area Based Load Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsAreaBasedLoadType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsAreaBasedLoadType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsAreaBasedLoadType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace